# Задание 2: Переворот строки

str_new = str(input('Введите любую строку:'))
# В данном случае через индексацию будем выводим строку наоборот
print(str_new[::-1])

